# SetObjPropDoubleVS

## Description
```pascal
FUNCTION SetObjPropDoubleVS(
				PropertyID  : LONGINT;
				PropertyVal : REAL) : BOOLEAN;
```

```python

def vs.SetObjPropDoubleVS(PropertyID, PropertyVal):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|PropertyID|LONGINT||
|PropertyVal|REAL||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events